Prit4747/IOT_HUB/sdkconfig.defaults
# ESP32-S3 IoT Hub -- configurable modem backend (SimCom A7672S/USB,
# Quectel EC200U-CN/UART, Quectel EC200U-CN/USB) + Full/Delta HTTPS OTA.
#
# These are the settings common to ALL THREE backends, merged from the
# three source projects (USB Modem / Quectel_EC200U / Quectel_EC200U_USB),
# which turned out to be identical apart from one USB-Host-only line (kept
# here unconditionally -- it only takes effect if USB host code actually
# runs, so it's harmless when the UART backend is selected).
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y

CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"

# lwIP PPP (required by both esp_modem and iot_usbh_modem)
CONFIG_LWIP_PPP_SUPPORT=y
CONFIG_LWIP_PPP_NOTIFY_PHASE_SUPPORT=y
CONFIG_LWIP_PPP_PAP_SUPPORT=y
CONFIG_LWIP_PPP_CHAP_SUPPORT=y
CONFIG_LWIP_PPP_MPPE_SUPPORT=n
CONFIG_LWIP_PPP_ENABLE_IPV6=n
CONFIG_LWIP_TCPIP_TASK_STACK_SIZE=4096
CONFIG_LWIP_MAX_SOCKETS=16

# LCP echo keepalives -- off by default in ESP-IDF. Without this, PPP has
# no way to detect a link that's silently died server-side (a common
# cellular carrier behavior: an idle PDP/NAT session gets dropped after
# some minutes with no explicit PPP terminate sent back) -- the app just
# keeps believing it's connected since no LOST_IP event ever fires.
# Observed in practice: internet self-test passed at boot, then an OTA
# attempt ~8 minutes later (no traffic in between) failed every DNS
# lookup with a real ~14s timeout each try, not an instant rejection --
# the exact signature of packets going into a dead link rather than an
# active refusal. 5s interval / 3 max fails means a genuinely dead link
# gets detected (and ppp_manager's existing LOST_IP-driven reconnect
# logic kicks in) within ~15-20s of going idle-dead, instead of never.
CONFIG_LWIP_ENABLE_LCP_ECHO=y
CONFIG_LWIP_LCP_ECHOINTERVAL=5
CONFIG_LWIP_LCP_MAXECHOFAILS=3

CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=4096
CONFIG_ESP_SYSTEM_EVENT_QUEUE_SIZE=64
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_LEVEL_VERBOSE=y

# HTTPS client over PPP
CONFIG_ESP_TLS_USING_MBEDTLS=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_FULL=y
CONFIG_ESP_TLS_INSECURE=y
CONFIG_ESP_TLS_SKIP_SERVER_CERT_VERIFY=y

CONFIG_ESP_WIFI_SOFTAP_SUPPORT=y
CONFIG_HTTPD_MAX_REQ_HDR_LEN=1024
CONFIG_HTTPD_MAX_URI_LEN=512
CONFIG_ESP_HTTPS_OTA_ALLOW_HTTP=y

# USB Host (ESP32-S3 OTG) -- only exercised when a USB backend
# (SimCom A7672S or Quectel EC200U/USB) is selected in menuconfig.
CONFIG_USB_HOST_CONTROL_TRANSFER_MAX_SIZE=256
